class HelpData {
  final String title;
  final String content;
  HelpData({
    required this.title,
    required this.content,
  });
}

final List<HelpData> helpData = [
  HelpData(
    title: 'اجعل الأمر مسليًا',
    content:
        'تقل فرصة حدوث تشتت لدى الطفل عند أداء وظيفة معقدة. وغالبًا ما يصاب الأطفال بالتشتت عندما لا تشكل الوظيفة تحديًا كافيًا لهم، ما يُعرف بالشرود.'
        '\nيعرف نقيض الشرود بفرط التركيز، عندما يركز الطفل فيما يفعل لدرجة عدم إدراك ما يحيط به. يشكل فرط التركيز تحديًا أيضًا، لكنه يساعد الطفل على القيام بالمهمة المطلوبة.'
        '\nتتطلب العديد من الهوايات والمهام درجة عالية من التركيز، لذا من الجيد تشجيع الطفل على المواصلة إن كان مستمتعًا بأداء التحديات بتركيز عالٍ.',
  ),
  HelpData(
    title: 'امنحهم الثناء والتشجيع',
    content:
        'من المهم تشجيع السلوك الإيجابي بالمديح، وكذلك لتجنب السلوك السيء.',
  ),
  HelpData(
    title: 'أنشئ نظامًا محددًا',
    content:
        'قد يقلل تحديد روتين يومي محدد من عوامل التشتيت المفاجئة، فمعرفة الطفل بمهماته سلفًا يساعده على الهدوء ويعلمه تحمل المسؤولية.',
  ),
  HelpData(
    title: 'شجعهم على ممارسة التمارين',
    content: 'يساعد التخلص من الطاقة المفرطة عبر التمارين على:'
        '\nتلافي الإصابة بالاكتئاب والقلق.'
        '\nتعزيز التركيز والانتباه.'
        '\nتحسين أنماط النوم.'
        '\nتنبيه الدماغ ويقظته.'
        '\nيستطيع الآباء تشجيع أبنائهم على ممارسة التمارين المنشطة، مثل ألعاب الكرة وقفز الحبل أو ركوب الدراجة أو تسجيلهم في نادٍ رياضي.'
        '\nمن الجيد أن يكون الآباء قدوة للأبناء في هذا المجال. يساعد اللعب خارجًا أو التنزه مع العائلة الطفل على تفريغ طاقته الزائدة واعتماد عادات صحية للمستقبل.',
  ),
  HelpData(
    title: 'احرص على عادات النوم الصحية',
    content:
        'أظهرت الدراسات أن عادات النوم السيئة لها تأثير سلبي في أعراض اضطراب فرط الحركة ونقص الانتباه. يساعد النوم الصحي على رفع مستويات النشاط في اليوم التالي والتخفيف من القلق وتحسين المزاج. لذا من المهم أن يحرص الآباء النظر على تحديد ساعات نوم منتظمة في نظام أطفالهم اليومي.',
  ),
  HelpData(
    title: 'تقسيم المهمات',
    content:
        'قد تبدو بعض المهام مفرطة التعقيد ومنفرة للطفل، لذا قسِّم المهمات إلى أهداف سهلة قدر الإمكان، لتبسيط الأمر والسيطرة على المشاعر المرتبطة بالنجاح والفشل.'
        '\nإذا طلبت من طفلك ترتيب غرفته، قسِّم الأمر إلى مهمات أصغر مثل ترتيب السرير أو إعادة ترتيب الألعاب أو طيّ الملابس.',
  ),
  HelpData(
    title: 'فكر بصوت عالٍ',
    content:
        'غالبًا ما يفتقر الأطفال المصابون باضطراب فرط الحركة ونقص الانتباه إلى القدرة على السيطرة على انفعالاتهم، فقد يقولون أو يفعلون شيئًا مباشرةً دون تفكير، لذا فحثّهم على التمهل ومشاركة أفكارهم بصوت عالٍ يمكّن الآباء من ملاحظة أساليب تفكير أطفالهم، ويمكِّن الطفل من التمهل لتقييم أفكاره واختيار تنفيذها أو عدم تنفيذها.',
  ),
  HelpData(
    title: 'الحد من عوامل التشتيت',
    content:
        'يفضل ترتيب وتبسيط البيئة المحيطة بالطفل إذا كان من السهل تشتيته وسلب انتباهه.'
        '\nمن المهم جعلهم يؤدون مهامهم بعيدًا عن إغراءات التلفاز أو الألعاب. يجب أيضًا إبعاد الألعاب عند أداء المهام في غرفتهم.',
  ),
  HelpData(
    title: 'الشرح عوضًا عن الأمر',
    content:
        'يستطيع الآباء أو مقدمو الرعاية منح أسباب منطقية مفهومة لطلبهم. اجعل شرحك بسيطًا وتوقع السؤال عن المزيد من التفاصيل. إن شرح أسباب المهمات يخفف من القلق والارتباك لدى الطفل. ويجب اعتماد لغة واضحة وإيجابية عند الشرح.'
        '\nإن شرح الأسباب يعزز من مكانة الطفل ويمنحه الاحترام، ويُعد احترام الذات أمرًا ضروريًّا لدى الطفل المصاب بهذا الاضطراب، إذ يشعر بأنه مختلف عن سواه.',
  ),
  HelpData(
    title: 'التعرف على وقت الانتظار',
    content:
        'إن فكرة وقت الانتظار مشابهة للتفكير بصوت عالٍ. إذا انتظر الطفل بضع ثوانٍ قبل الكلام أو الفعل، سيُتاح له الوقت للحكم على تصرفه.'
        '\nسيتطلب هذا الأمر الكثير من التدريب، لكنه سيكون مجديًا في النهاية، وسيمنحهم خبرةً اجتماعيةً جيدةً في التعامل مع محيطهم.',
  ),
  HelpData(
    title: 'تجنب الضغط',
    content:
        'لا يؤذي القلق المفرط الصحة العامة للآباء فحسب، بل يقلل دعمهم لأطفالهم أيضًا، لذا يجب طلب الدعم عندما يزداد ضغط العمل والالتزامات وتبدأ بالشعور بالارتباك. قد تجد الدعم في أصدقائك أو عائلتك أو المجموعات المحيطة. قد يفيد حذف بعض المهام من جدولك الأسبوعي، ما يقلل من التوتر.',
  ),
  HelpData(
    title: 'تجنب استخدام لغة سلبية',
    content:
        'تبني الآراء والانتقادات البناءة ثقة الطفل بنفسه. قد يشعر الأطفال المصابون باضطراب فرط الحركة ونقص الانتباه أنهم غير محبوبين أو أنهم دومًا مخطئون، إذ تجرح اللغة السلبية شعورهم وتزيد التصرفات الطائشة سوءًا.'
        '\nمن المستحيل الحفاظ على الإيجابية طوال الوقت، لذا على الآباء إيجاد طريقٍ لصياغة مخاوفهم ومشكلاتهم، بمساعدة صديق أو شريك أو معالج نفسي.'
        '\nتوجد الكثير من المجموعات عبر الإنترنت مخصصة لآباء المصابين باضطراب فرط الحركة ونقص الانتباه، حيث يتشاركون التحديات التي يواجهون.',
  ),
  HelpData(
    title: 'لا تسمح للاضطراب بالسيطرة',
    content:
        'تجاوز عن بعض الزلات، ولكن اعلم أن اضطراب فرط الحركة ونقص الانتباه لا يُعد عذرًا للسلوك السيء. يجب وضع حدود للأطفال والآباء، ومن الضروري أن يتعلم الطفل عواقب تصرفاته السيئة.',
  ),
  HelpData(
    title: 'انتقِ معاركك',
    content:
        'إن العيش مع طفل يعاني فرط النشاط والسلوك الاندفاعي هو تحدٍّ قائم ومتواصل. إذا أمعن الآباء النظر في كل مشكلة وكل سلوك، فسوف يظهر التوتر والانزعاج على الجميع طوال الوقت.'
        '\nتجاهل الأخطاء الصغيرة، فهذا يخفف من التوتر على المدى الطويل، ويساعد الآباء على التركيز والسيطرة على المشكلات الكبيرة.',
  ),
  HelpData(
    title: 'لا تعامل الآخرين بعدوانية',
    content:
        'إن مشاعر الحماية والوصاية طبيعية لدى الوالدين، لكن عندما يكون طفلهم مصابًا باضطراب فرط الحركة ونقص الانتباه، لا يبدو على مقدمي الرعاية الاهتمام أو التفهم الكافي. إن التواصل الجيد كفيل بحل هذا الخلاف، ومن المفيد الحديث عن الاضطراب مع من يتواصل معهم طفلك.',
  ),
  HelpData(
    title: 'تابع العمل على تغيير سلوكه',
    content:
        'قد تشعر أنك استنفدت كل المحاولات لتعديل سلوك طفلك. لا تستسلم، تحل بالصبر وحاول أن تغير من استراتيجيتك، وتذكر أن الأمر يستغرق وقتًا.',
  ),
  HelpData(
    title: 'احصل على دعم متخصص',
    content:
        'يتعامل المعالج النفسي المتخصص مع قلق الآباء إضافةً إلى سلوكيات الطفل. قد تجد الدعم لدى مجموعات محلية أو دولية أو آباء مروا بظروف مشابهة.',
  ),
  HelpData(
    title: 'احصل على استراحة',
    content:
        'من المرهق التركيز على طفلك يومًا كاملًا، دع جليس أطفال يتولى الأمر بعض الوقت أو تبادل المهام مع شريكك. كلما زادت طاقتك تحسن تعاملك مع التوتر.',
  ),
  HelpData(
    title: 'حافظ على هدوئك',
    content: 'لتستطيع التركيز على الحلول والتواصل جيدًا، حافظ على هدوئك عبر:'
        '\nالتأمل.'
        '\nممارسة اليوغا.'
        '\nالالتزام بالروتين والتوقف عن القلق بشأن المستقبل.'
        '\nالمشي في الطبيعة.'
        '\nالتقليل من الكافيين والكحول.',
  ),
  HelpData(
    title: 'تذكر أن جميع الأطفال يخطئون',
    content:
        'ليست كل مشكلة تواجهها سببها هذا الاضطراب، فكل الأطفال قد يسيئون التصرف. حاول التمييز بين السلوكيات المختلفة والتعامل معها.',
  ),
  HelpData(
    title: 'لا تقسُ على نفسك',
    content:'ربما قد تظن أن غيرك من الآباء قد حققوا تقدمًا أفضل منك، لكنك إذا تحدثت إليهم ستجد أن كل منهم يظن الشيء نفسه. توقف عن لوم نفسك وكن فخورًا بما حققته حتى الآن.'
        '\nكيف أتحدث إلى أطفالي حول اضطراب فرط الحركة ونقص الانتباه؟'
        '\nيُشخص المرض وسطيًا بعمر سبع سنوات. عند التحدث مع أطفالك حول اضطراب فرط الحركة ونقص الانتباه، احرص على استخدام لغة بسيطة ملائمة. ابدأ حديثك معهم بذكر أن:'
        '\nاضطراب فرط الحركة ونقص الانتباه ليس عيبًا:'
        '\nفهو لا يجعلهم مختلفين عن البقية، ويمكن الحد من تأثيره السلبي في حياة الطفل بالدعم المناسب.'
        '\nلا يؤثر الاضطراب في ذكائهم:'
        '\nذكرهم أن بعضًا من أعظم المفكرين شُخصوا به أيضًا، ومن ضمنهم ألبرت أينشتاين وتوماس إديسون.'
        '\nبإمكان الأفراد المصابين النجاح والتفوق في حياتهم:'
        '\nاضرب لهم مثالًا حيًّا على ذلك، كجار قريب أو مشهور محبوب.'
        '\nهم ليسوا بمفردهم'
        '\nمن بين كل عشرة أطفال يوجد طفل مصاب بهذا الاضطراب في الولايات المتحدة، وقد ترتفع النسبة لتصبح طفلًا من بين كل خمسة أطفال أو 20 بالمئة تقريبًا. قد يشعر الطفل المصاب بالوحدة، لذا من الضروري خلق بيئة تساعده على الاندماج كمجموعات تضم أطفالًا مشابهين، ما يساعده على كسب مهارات اجتماعية والتغلب على شعور الوحدة.',
  ),
];
